app/views/trips/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "trip_participations" ON "users"."id" = "trip_participations"."user_id" WHERE "trip_participations"."trip_id" = $1  [["trip_id", 1]]
---
              <%= link_to trip.name, trip_path(trip) %> <br>
              <% trip.users.each do |user| %>