app/views/trips/show.html.erb


<% if @current_user.trips.include? @trip %>
---
SELECT  1 AS one FROM "trips" INNER JOIN "trip_participations" ON "trips"."id" = "trip_participations"."trip_id" WHERE "trip_participations"."user_id" = $1 AND "trips"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]

			<div id="users">
				<% @trip.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "trip_participations" ON "users"."id" = "trip_participations"."user_id" WHERE "trip_participations"."trip_id" = $1  [["trip_id", 1]]