app/views/users/show.html.erb

		      <div id="trips">
		      	<% if @user.trips.count()==1 %>
---
SELECT COUNT(*) FROM "trips" INNER JOIN "trip_participations" ON "trips"."id" = "trip_participations"."trip_id" WHERE "trip_participations"."user_id" = $1  [["user_id", 2]]