app/controllers/locations_controller.rb

	def destroy
		Location.find_by(id: params[:id]).destroy
---
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 9]]
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]