app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" INNER JOIN "trip_participations" ON "trips"."id" = "trip_participations"."trip_id" WHERE "trip_participations"."user_id" = $1  [["user_id", 1]]
---
	def index
		@trips = @current_user.trips.all

INSERT INTO "trips" ("name", "description", "initdate", "enddate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		trip = Trip.new(trip_params)
		if trip.save

SELECT "locations".* FROM "locations" WHERE "locations"."trip_id" = $1 ORDER BY initdate DESC  [["trip_id", 3]]
---
	def show
		unless trip.present?
			render :file => 'public/404.html'
		end
		trip
		@users = User.all
		@message = Message.new
		@locations = @trip.locations.order('initdate ASC')

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 5]]
---
	def destroy
		trip.destroy

INSERT INTO "locations" ("trip_id", "name", "initdate", "enddate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["trip_id", 2], ["name", ""], ["initdate", 2017-03-30 00:00:00 UTC], ["enddate", 2017-03-31 00:00:00 UTC], ["created_at", 2017-03-25 18:12:15 UTC], ["updated_at", 2017-03-25 18:12:15 UTC]]
---
	def add_location_to_trip
		trip
		location = trip.locations.new(location_params)
		if (Trip.validateDates @trip, location) == []
			if location.save