app/controllers/users_controller.rb

	def show
		@user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def show_users
		@users = User.all.map do |user|
---
SELECT "users".* FROM "users" WHERE (CONCAT_WS(' ', lower(firstname), lower(lastname)) like '%%')

	def upload_avatar
		if @current_user.update_attribute(:avatar, params[:user][:avatar])
---
UPDATE "users" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["avatar_file_name", "brand.png"], ["avatar_file_size", 74547], ["avatar_updated_at", 2017-03-29 22:52:31 UTC], ["updated_at", 2017-03-29 22:52:33 UTC], ["id", 1]]